//Напишите программу, которая принимает на вход цифру
//обозначающую день недели и проверяет, является ли этот день
//Выходным.
Console.WriteLine("Введите цифру дня недели (считая понедельник первым): ");
string? daynumber = Console.ReadLine();
if (daynumber == "6")
   Console.WriteLine("Выходной день");
   else if (daynumber == "7")
   Console.WriteLine("Выходной день");
else if (daynumber == "1")
   Console.WriteLine("Будний день");
   else if (daynumber == "2")
   Console.WriteLine("Будний день");
   else if (daynumber == "3")
   Console.WriteLine("Будний день");
   else if (daynumber == "4")
   Console.WriteLine("Будний день");
   else if (daynumber == "5")
   Console.WriteLine("Будний день");
else Console.WriteLine("Вы ввели не день недели");

                    
