// Напишите программу, которая на входе принимает два числа и выдаёт, 
//какое число больше, а какое меньше. 
// a = 5; b = 7 --> max = 7
// a = 2; b = 10 --> max =10
// a = -9; b = -3 --> max = -3 
Console.WriteLine("Введите первое число: ");
string numberA = Console.ReadLine();
Console.WriteLine("Введите второе число: ");
string numberB = Console.ReadLine();
